{
    "app_title": "Sina's Site",

    "menu": {
        "portfolio": "Portfolio",
        "resume": "Resume",
        "home": "Home",
        "contact": "Contact"
    },
    
    "titles": {
        "about": "ABOUT ME",
        "skills": "SKILLS",
        "languages": "LANGUAGES",
        "portfolio": "PORTFOLIO"
    },

    "buttons": {
        "cv": "Download CV",
        "contact": "Contact me!",
        "visit": "Visit",
        "github": "GitHub",
        "send": "Send"
    },

    "time": {
        "years": "yrs",
        "year": "yr",
        "months": "mos",
        "month": "mo"
    },

    "front": {
        "im": "Hi, I'm Sina Olfati",
        "job": "Front-end Developer",
        "description": "A self-taught Front-end Developer (React, Next) with over 2 years of experience in building real-world web applications in production environments. I have extensive experience in developing web applications using modern open-source technologies and possess exemplary communication skills."
    },


    "home_top1": "In the realm of coding, my devotion lies in Front-end",
    "home_top2": "React and Next are my enlightened guides",
    "home_scroll": "Scroll",
    "home_middle_im": "I am,",
    "home_middle_name": "SINA OLFATI",
    "home_bottom_age": "20 year's  old",
    "home_bottom_teacher": "Teacher! (From september 2021)",
    "home_bottom_learning": "My food is learning",
    "home_bottom_ui": "Building UIs is essential for my emotional stability",
    "home_bottom_friends": "My hobby is to find new friends",
    "home_bottom_alone": "But I'm always alone(food is more important)",
    "home_bottom_live": "Body lives in Iran, soul in YouTube",
    "home_bottom_politics": "Scared of political relations between nations",
    "home_bottom_wanting": "Why would you want me?",
    "home_bottom_compatible": "Compatible with every tough situation",
    "home_bottom_learning2": "I learn whatever comes out from your mouth",
    "home_bottom_new": "Leave me alone for one second, I dive into new things",
    "home_bottom_exercise": "You can come and exercise with me",
    
    "about": {
        "describtion": "Highly skilled and passionate developer with expertise in React.Js and Next.Js. Proven track record of delivering high-quality software solutions. Strong problem-solving abilities and a dedication to continuous learning. Experienced in collaborating with cross-functional teams and delivering projects on time. Committed to optimizing user experiences and driving innovation. Open to new challenges and eager to contribute to a dynamic and growth-oriented company!",
        "experience": "Years experience",
        "projects": "Completed projects",
        "companies": "Companies worked"
    },


    "work": {
        "title": " Work Experience",

        "freelancing-title": "Freelance Front-end Developer",
        "freelancing-time": "11/2021 - Present",
        "freelancing-about1": "Successfully completed 10+ freelance projects as a front-end developer over a span of 2+ years",
        "freelancing-about2": "Developed responsive and user-friendly websites using React, Next and Vanilla JS, resulting in a 95% client satisfaction rate",
        "freelancing-about3": "Implemented efficient coding practices, including modular and reusable components, resulting in a 20% increase in development speed and maintainability",
        "freelancing-about4": "Integrated third-party APIs and libraries, such as Axios and Redux, to enhance website functionality and user experience, resulting in a 25% improvement in overall website performance",

        "teaching-title": "English Teacher",
        "teaching-place": "Chitsazan Language Institute",
        "teaching-place-describe": "Academy of Foreign languages - English, German & French",
        "teaching-time": "11/2023 - 01/2025",
        "teaching-workplace": "Tabriz - Iran",
        "teaching-about1": "Employed at the best English academy in the western and north-western regions of Iran with 5+ branches all over Tabriz",
        "teaching-about2": "Successfully completed a rigorous and highly selective process to be elected for the teaching position, being one of 25 individuals chosen out of 280 candidates",
        "teaching-about3": "Developed and implemented lesson plans tailored to meet the needs of diverse student populations",
        "teaching-about4": "Utilized technology and multimedia resources to supplement classroom instruction",

        "iranfavagostaresh-title": "Front-end Developer",
        "iranfavagostaresh-place": "Iran Fava Gostaresh",
        "iranfavagostaresh-place-describe": "Provider of specialized services and solutions in the field of information technology, especially ERP",
        "iranfavagostaresh-time": "12/2022 - 8/2023",
        "iranfavagostaresh-workplace": "Tehran - Iran",
        "iranfavagostaresh-about1": "Worked for 9 months in Iran Fava Gostaresh, the Subsidiary and IT company of Irankhodro, the biggest car manufacturer in the Middle East",
        "iranfavagostaresh-about2": "Participated in specialized training courses aimed at improving high-qualified IT knowledge within the country, resulting in a 20% increase in IT proficiency",
        "iranfavagostaresh-about3": "Acquired skills in project management, problem-solving, and effective communication in a professional environment, resulting in a 35% increase in project success rate",
        "iranfavagostaresh-about4": "Developed a deep understanding of the IT needs and challenges faced by different industries, leading to a 30% improvement in client satisfaction",
        
        "vmodel-title": "JavaScript Developer",
        "vmodel-place": "VModel",
        "vmodel-place-describe": "Booking platform + Digital Agency for Models, Influencers, Photographers, Creators and PetModels",
        "vmodel-time": "05/2022 - 11/2022",
        "vmodel-workplace": "London - England(UK)",
        "vmodel-about1": "Led the web development team, consisting of 4 members, for 3 weeks; Increased quality and speed by 30%",
        "vmodel-about2": "Mentored junior developers, conducting knowledge-sharing sessions on JavaScript best practices, resulting in a 50% improvement in their coding skills",
        "vmodel-about3": "Collaborated with a diverse team of developers, designers, and stakeholders, fostering a collaborative work environment that promoted cultural exchange and innovation",
        "vmodel-about4": "Collaborated with the UX team to ensure cross-browser compatibility, resulting in a 20% improvement in user experience across different devices and platforms",
    
        "clickhub-title": "React Developer Intern",
        "clickhub-place": "Clickhub (Noavaran Dadepardaz click)",
        "clickhub-place-describe": "Design and production of organizational management software and proprietary software",
        "clickhub-time": "05/2022 - 08/2022 (2.5 months)",
        "clickhub-workplace": "Tehran - Iran",
        "clickhub-about1": "Actively engaged in daily stand-ups and sprint planning meetings, contributing to agile development processes and project progress tracking",
        "clickhub-about2": "Worked closely with designers and product managers to translate UI/UX wireframes and requirements into functional React components.",
        "clickhub-about3": "Assisted in the creation and maintenance of reusable React components, enhancing code efficiency and reducing development time",
        "clickhub-about4": "Learned: Redux, Redux-Thunk, TypeScript, PWA, Material UI, Formik, Docker, Scrum, PSD to HTML"
    },


    "education": {
        "title": " Education",

        "univercity1-title": "Bachelor's of Computer Science",
        "univercity1-place": "Shiraz University",
        "univercity1-time": "08/2021 - Present",
        "univercity1-workplace": "Shiraz - Iran",
        "univercity1-about": "Took part at a Front-end developing bootcamp!",

        "univercity-title": "Bachelor's of Teaching Experimental Science",
        "univercity-place": "Allameh Amini Farhangian University",
        "univercity-time": "08/2021 - Present",
        "univercity-workplace": "Tabriz - Iran",
        "univercity-about": "",
    
        "english-title": "''Perfect'' grade English language diploma",
        "english-place": "Padideh Academy of Foreign Languages",
        "english-time": "2018",
        "english-workplace": "Qasr-e Shirin - Iran",
        "english-about": "",
    
        "kangaroo-title": "Honorary diploma in mathematics",
        "kangaroo-place": "Math Kangaroo international Olympiad",
        "kangaroo-time": "2016",
        "kangaroo-workplace": "",
        "kangaroo-about": ""
    },


    "article": {
        "title": " Articles",
        "sectinos": {
            "type": "Type:",
            "year": "Year:",
            "language": "Language:",
            "writers": "Writers:",
            "abstract": "abstract",
            "keywords": "Keywords:"
        },

        "One_ComparativeStudy_MathEducation_Iran_Japan-title": "Comparative Analysis of Math Education in Iran and Japan: Aligning with Global Trends",
        "One_ComparativeStudy_MathEducation_Iran_Japan-publication": "1st National Conference on Expert Teacher",
        "One_ComparativeStudy_MathEducation_Iran_Japan-type": "Conference",
        "One_ComparativeStudy_MathEducation_Iran_Japan-language": "English",
        "One_ComparativeStudy_MathEducation_Iran_Japan-writers": "Sina Olfati",
        "One_ComparativeStudy_MathEducation_Iran_Japan-abtract": "This study compares the mathematics education systems of Iran and Japan, examining the influence of globalization and emerging technologies, particularly artificial intelligence (AI). The analysis highlights Japan’s successful GIGA School Program, which enhances student engagement through digital tools, while Iran’s National STEM Initiative reveals challenges in resource allocation and equity, especially in rural areas. The findings suggest critical policy implications, advocating for targeted teacher training, improved digital infrastructure, and inclusive curricular reforms to ensure equitable access to quality mathematics education. By fostering international collaboration and aligning with global standards, both countries can enhance their educational systems and better prepare students for the 21st century.",
        "One_ComparativeStudy_MathEducation_Iran_Japan-keywords": "Mathematics Education, Iran, Japan, STEM Education, Globalization, Artificial Intelligence, Teacher Training, Digital Infrastructure, Curriculum Reform, Equity in Education",
    
        "Two_AI_Collaborative_Tool_Teacher_Student_Interactions-title": "AI as a Collaborative Tool: Redefining Teacher-Student Interactions",
        "Two_AI_Collaborative_Tool_Teacher_Student_Interactions-publication": "14th International Conference on Modern Research in Psychology, Social Sciences and Educational Sciences",
        "Two_AI_Collaborative_Tool_Teacher_Student_Interactions-type": "Conference",
        "Two_AI_Collaborative_Tool_Teacher_Student_Interactions-language": "English",
        "Two_AI_Collaborative_Tool_Teacher_Student_Interactions-writers": "Sina Olfati",
        "Two_AI_Collaborative_Tool_Teacher_Student_Interactions-abtract": "The rapid integration of Artificial Intelligence (AI) in educational contexts presents both unprecedented opportunities and complex challenges. This article explores the transformative potential of AI technologies in enhancing teaching and learning experiences, emphasizing personalized education, data-driven decision-making, and collaborative learning environments. Through a comprehensive review of recent literature and empirical studies, we identify key findings that highlight the effectiveness of AI in fostering student engagement and improving academic outcomes. Furthermore, we address critical ethical considerations surrounding data privacy and algorithmic bias, underscoring the necessity for responsible AI implementation. The article culminates in actionable recommendations for educators and policymakers, advocating for the establishment of clear guidelines, ongoing professional development, and equitable access to AI tools. By fostering a collaborative dialogue among educators, researchers, and policymakers, this work aims to contribute to the evolving discourse on AI in education and its potential to shape the future of learning. Ultimately, we call for a concerted effort to leverage AI technologies ethically and effectively, ensuring that all learners benefit from the advancements in this dynamic field.",
        "Two_AI_Collaborative_Tool_Teacher_Student_Interactions-keywords": "Artificial Intelligence, Education, Personalized Learning, Data-Driven Decision-Making, Student Engagement, Ethical Considerations, Algorithmic Bias, Responsible AI Implementation, Collaborative Learning, Future of Learning",
    
        "Three_AI_Personalized_Learning_Underrepresented_Student_Groups_Impact_Analysis-title": "Exploring the Impact of AI-Driven Personalized Learning on Underrepresented Student Groups",
        "Three_AI_Personalized_Learning_Underrepresented_Student_Groups_Impact_Analysis-publication": "8th International Conference on Interdisciplinary Studies in Psychology, Counseling, Education and Nurture Sciences",
        "Three_AI_Personalized_Learning_Underrepresented_Student_Groups_Impact_Analysis-type": "Conference",
        "Three_AI_Personalized_Learning_Underrepresented_Student_Groups_Impact_Analysis-language": "English",
        "Three_AI_Personalized_Learning_Underrepresented_Student_Groups_Impact_Analysis-writers": "Sina Olfati",
        "Three_AI_Personalized_Learning_Underrepresented_Student_Groups_Impact_Analysis-abtract": "This study investigates the impact of AI-driven personalized learning tools on engagement and academic performance among underrepresented student groups. Utilizing platforms such as SmartLearning, EduAI, and LearnMate, the research reveals a significant 30% increase in student engagement and a 15% improvement in academic outcomes. Qualitative feedback highlights the importance of personalized feedback and culturally relevant content in fostering student motivation and ownership of learning. Despite these positive findings, challenges such as access to technology, varying levels of digital literacy, and the need for pedagogical alignment remain critical barriers to effective implementation. The study emphasizes the necessity for a multifaceted approach involving educators, policymakers, and technology developers to ensure equitable access and maximize the benefits of AI in education. Future research directions include exploring the long-term effects of personalized learning tools and addressing ethical considerations related to AI algorithms in educational contexts.",
        "Three_AI_Personalized_Learning_Underrepresented_Student_Groups_Impact_Analysis-keywords": "AI-driven learning, personalized learning, engagement, academic performance, underrepresented students, educational technology, digital literacy, culturally relevant content, equity in education, educational outcomes",

        "Four_ECE_Neural_Plasticity_Neuroscience_Education_Perspective-title": "The Impact of Early Childhood Education on Neural Plasticity: A Neuroscientific and Educational Perspective",
        "Four_ECE_Neural_Plasticity_Neuroscience_Education_Perspective-publication": "1st National Conference on Expert Teacher",
        "Four_ECE_Neural_Plasticity_Neuroscience_Education_Perspective-type": "Conference",
        "Four_ECE_Neural_Plasticity_Neuroscience_Education_Perspective-language": "English",
        "Four_ECE_Neural_Plasticity_Neuroscience_Education_Perspective-writers": "Sina Olfati, Mahmood Zolfalizadeh",
        "Four_ECE_Neural_Plasticity_Neuroscience_Education_Perspective-abtract": "This article explores the profound impact of early childhood education (ECE) on neural plasticity, integrating perspectives from neuroscience and education. Early experiences play a pivotal role in shaping brain development, particularly during critical periods of synaptic pruning and growth. Through the examination of various educational interventions, including play-based and structured learning models, this study highlights how ECE influences cognitive, social, and emotional development by promoting neural connectivity. Case studies and neuroscientific findings reveal the measurable effects of ECE on brain function, emphasizing the importance of timely, enriching experiences for optimal development. The article also identifies gaps in the current literature and calls for further research to enhance educational practices and policies.",
        "Four_ECE_Neural_Plasticity_Neuroscience_Education_Perspective-keywords": "early childhood education, neural plasticity, brain development, cognitive development, educational interventions, neural connectivity, critical periods, neuroscience, brain function, enriching experiences",

        "five_name-title": "????",
        "five_name-publication": "1st National Conference on Expert Teacher",
        "five_name-type": "Conference",
        "five_name-language": "Farsi",
        "five_name-writers": "Mahmood Zolfalizadeh, Sina Olfati",
        "five_name-abtract": "??????",
        "five_name-keywords": "?????"
    },


    "languages": {
        "describe": "You know, I'm a dictionary myself!",
        "japanese": "Japanese",
        "japanese-level": "JLPT N3",
        "english": "English",
        "english-level": "Fluent",
        "persian": "Persian",
        "persian-level": "Native",
        "kurdish": "Kurdish",
        "kurdish-level": "Native"
    },

    "portfolio": {
        "car-name": "CAR RENTAL",
        "car-description": "An online platform that allows users to rent cars for personal or business use. The website provides an interface for searching, comparing, and reserving cars.",
        "car-technologies": "React - Sass - JavaScript",

        "gymate-name": "GYMATE",
        "gymate-description": "A gym website is a comprehensive resource for fitness information, class schedules, membership options, and tools to help users achieve their fitness goals.",
        "gymate-technologies": "React - Tailwind CSS - JavaScript",

        "ecommerce-name": "RAOUF ECOMMERCE",
        "ecommerce-description": "With a focus on simplicity and clean design, this store prioritize user experience, making it easy for customers to find and purchase the products they need.",
        "ecommerce-technologies": "React - JavaScript - CSS",

        "lover-name": "Lover369 Dating App",
        "lover-description": "Lover369 is a safe and secure dating platform that provides the opportunity for singles to find their love.",
        "lover-technologies": "React - TypeScript - Zustand - Socket.io - Axios - Tailwind CSS - Material UI",

        "neoki-name": "Neoki Multi Metaverse",
        "neoki-description": "A platform to breaking down barriers in the world of design. From high-fashion to innovative interior concepts, Neoki aims to democratize creative and design space!",
        "neoki-technologies": "Next - Gsap - Three.Js - Swiper - Tailwind CSS",

        "luckyDuck-name": "Lucky Duck",
        "luckyDuck-description": "Invest in pools and ensure the growth of your business! By investing in pools, you can accelerate the growth and development of your business. Additionally, build your own pools and generate income.",
        "luckyDuck-technologies": "React - Redux - Bootstap - Sass - JavaScript",

        "mySite-name": "Sina's Site",
        "mySite-description": "The site that you are currently looking at! I hope you like it.",
        "mySite-technologies": "React, TypeScript, PWA(It is installable), Material Ui, SPA, Formik, i18next(made it multilingual), JavaScript, CSS, HTML",

        "resumeTemplate-name": "Sina's Resume Template",
        "resumeTemplate-description": "Enjoy the animations and simplicity of this new resume template!",
        "resumeTemplate-technologies": "Next, TypeScript, Tailwind CSS, JavaScript, CSS, HTML",

        "digitex-name": "Digitex Online Exchange",
        "digitex-description": "Recieve and transfer money, all by the help of crypto currencies!",
        "digitex-technologies": "Postgresql, Next, Tailwind and Antd",

        "caribCoin-name": "Caribean Coin",
        "caribCoin-description": "Have you heard of this new coin? Don't loose time and buy some as it's still preselling!",
        "caribCoin-technologies": "React, Material UI, Js, HTML and CSS"
    },


    "contact": {
        "emailme": "Email Me",
        "name-placeholder": "Name",
        "email-placeholder": "Your email",
        "message-placeholder": "Message",
        "name-error": "Please enter your name",
        "message-error": "Please write a message",
        "email-error1": "Please enter your email",
        "email-error2": "Email format is not correct",
        "update": "I'm learning... New updates will come"
    }
}
